# 할당
a = [1, 2, 3, 4]
b = a
b[0] = 100

print(a) # [100, 2, 3, 4]
print(b) # [100, 2, 3, 4]

## --> 복사된 것이 아닌 동일한 객체가 됨

a = 20
b = a
b = 10 # 불변한 값이기 때문에, 같은 주소에 다른 값을 둘 수 없음.

print(a) # 20
print(b) # 10

# 얕은 복사
a = [1, 2, 3]
b = a[:] # 슬라이싱은 새로운 리스트를 반환
c = a.copy()

print(a, b, c) # [1, 2, 3] [1, 2, 3] [1, 2, 3]

b[0] = 100
c[0] = 999
print(a, b, c) # [1, 2, 3] [100, 2, 3] [999, 2, 3]

# 얕은 복사의 한계
a = [1, 2, [3, 4, 5]]
b = a[:]
b[2][1] = 100
print(a) # [1, 2, [3, 100, 5]]
print(b) # [1, 2, [3, 100, 5]]

b[0] = 999
print(a) # [1, 2, [3, 100, 5]]
print(b) # [999, 2, [3, 100, 5]]


# 깊은 복사
import copy
a = [1, 2, [3, 4, 5]]
b = copy.deepcopy(a)

b[2][1] = 100

print(a)
print(b)